import { TextType } from './textType';

const ukrainian = {
  Settings: 'Налаштування',
  Theme: 'Тема',
  Language: 'Мова',
  Ukrainian: 'Українська',
  English: 'English',
  // language screen
  YourLanguage: 'Ваша мова',
  OtherLanguages: 'Інші мови',
  AfterChangingLanguageWarning:
    'Після зміни мови, словниковий набір буде змінено на нову мову. Ваш прогрес буде збережено.', // Ви все одно можете змінити його на будь-яку мову, яку бажаєте в налаштуваннях словникового набору.',
  // theme screen
  YourTheme: 'Ваша тема',
  OtherThemes: 'Інші теми',
  // game modes screen
  NewGame: 'Нова гра',
  Easy: 'Легко',
  Hard: 'Складно',
  Stamina: 'Витривалість',
  EasyTitle: 'Легкий режим',
  HardTitle: 'Складний режим',
  StaminaTitle: 'Режим на витривалість',
  Start: 'Почати',
  easyDescription:
    '• Обмежена кількість слів\n• Можна повертатись до попередніх\n• Відкритий список всіх слів',
  hardDescription:
    '• Обмежена кількість слів\n• До попередніх карток повертатись не можна\n• Список слів недоступний',
  staminaDescription:
    '• Небмежена кількість слів\n• До попередніх карток повертатись не можна\n• Список слів недоступний',
  gamePreambula:
    '• На екрані будуть карточки зі словами\n• Перемикайтесь між ними та запам’ятайте їх у правильному порядку за найкоротший час\n• Після цього перейдіть до перевірки і введіть всі слова\n• Завершіть спробу та ознайомтесь із результатом',
  startWhenReady: 'Починайте коли будете готові\nЧас почнеться одразу',

  NumberOfWordsForExercise: 'Кількість слів для вправи',
  wordsMaxWarning: 'Максимальна кількість слів доступна #',
  CloseGameWarningTitle: 'Припинити гру',
  CloseGameWarning:
    'Ви точно хочете припинити гру?\nСпроба буде зарахована, і буде збережена в історії як не завершена',
  CancelGameWarningTitle: 'Скасувати гру',
  CancelGameWarning:
    'Ви точно хочете скасувати гру?\nВаш прогрес не буде збережено',
  Cancel: 'Скасувати',
  Continue: 'Продовжити',
  goBack: 'Повернутись',
  Stop: 'Припинити',
  Check: 'Перевірити',
  IfYouReadyToCheck: 'Якщо ви вивчили всі слова і готові перейти до перевірки',
  list: 'cписок',
  backToCards: 'до карток',
  timeMemorizing: 'час запам’ятовування',
  sec: 'сек',
  min: 'хв',
  hours: 'год',
  IfYouEnteredWords: 'Якщо ви ввели всі слова і готові завершити спробу',
  Finish: 'Завершити',
  ConfirmWarningTitle: 'Завершити спробу',
  ConfirmWarning: 'Завершити спробу, навіть з наявними пустими полями',
  correctWordsMemorized: 'вивчених слів',
  TotalWordsMemorized: 'Усього вивчених слів',
  Words: 'Слів', // 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20
  Words23: 'Слова', // 2 3
  Word: 'Слово', // 1
  Days: 'Днів',
  Day: 'День',
  PersonalBestResults: 'Особисті найкращі результати',
  Today: 'Сьогодні',
  Yesterday: 'Вчора',
  PastWeek: 'Минулого тижня',
  PastMonth: 'Минулого місяця',
  PastYear: 'Минулого року',
  AllTime: 'За весь час',
  Accuracy: 'Точність',
  inPastWeek: 'за минулий тиждень',
  inPastMonth: 'за минулий місяць',
  inPastYear: 'за минулий рік',
  inPast30Days: 'за минулі 30 днів',
  inAllTime: 'за весь час',
  DailyAverage: 'Середнє за день',
  TimePlaying: 'Час ігор',
  GamesCompleted: 'Завершених ігор',
  MondayShort: 'Пн',
  TuesdayShort: 'Вт',
  WednesdayShort: 'Ср',
  ThursdayShort: 'Чт',
  FridayShort: 'Пт',
  SaturdayShort: 'Сб',
  SundayShort: 'Нд',
  WordsAmount: 'Кількість слів',
  UserData: 'Дані користувача',
  Export: 'Експорт',
  ExportDescription:
    'Експортовані дані можна використовувати як резервну копію або для перенесення вашого прогресу на інший пристрій.\nЕкспортуючи дані, ви не втрачаєте свій прогрес на цьому пристрої. Під час імпорту даних на поточний пристрій попередні дані будуть перезаписані',
  Import: 'Імпорт',
  ImportDescription:
    'Імпортовані дані перезапишуть весь ваш поточний прогрес.\nПісля завантаження файлу вам буде показано вікно для підтвердження вашого вибору з короткими даними файлу',
  DangerZone: 'Небезпечна зона',
  WipeData: 'Стерти дані',
  WipeDataDescription:
    'Ця дія видалить всі ваші дані та прогрес у грі та дозволить вам почати спочатку',
  Statistics: 'Статистика',
  quote1:
    '“Інтелектуальний ріст повинен починатися з народження і припинятися лише після смерті.”',
  quote1Author: 'Альберт Ейнштейн',
  Explanation:
    'Гра складається з двох етапів:\n\n1. Запам\'ятовування\n2. Перевірка (введення запам\'ятованих слів)\n\nПід час етапу запам\'ятовування вам будуть показані картки зі словами. Ви можете перемикатися між ними та витрачати стільки часу, скільки вам потрібно, щоб запам\'ятати їх.\nКоли ви відчуєте себе готовим до перевірки, натисніть кнопку "Перевірити".\n\nПід час етапу перевірки вам потрібно ввести всі слова в правильному порядку. Ви не можете бачити список всіх слів або повертатися до карток після того, як переключилися на етап перевірки. Коли ви закінчите вводити слова, натисніть кнопку "Завершити", щоб побачити свій результат.',
  GameModeExplanation:
    'У режимі Легко ви запам’ятовуєте обмежену кількість слів, ви зможете повернутися до попередніх карток і переглянути список усіх слів під час етапу запам’ятовування.\n\nУ режимі Складно ви також запам’ятовуєте обмежену кількість слів, але ви не зможете повернутися до попередніх карток або переглянути список усіх слів під час етапу запам’ятовування.\n\nУ режимі Витривалість ви запам’ятовуєте необмежену кількість слів, без можливості повернутися до попередніх карток або переглянути список усіх слів під час етапу запам’ятовування. Але в цьому режимі ви можете зупинити запам’ятовування в будь-який момент на будь-якій кількості слів.',
  PreGameEasyHardExplanation:
    "На цьому екрані ви можете вибрати, скільки слів ви хочете запам'ятати під час гри. Чим більше слів ви оберете, тим важче буде їх запам'ятати, а всі слова, які ви не запам'ятаєте, будуть вважатися невивченими, тому оберіть кількість слів, яку, на вашу думку, ви можете запам'ятати, щоб отримати найкращий результат.",
  PreGameStaminaExplanation:
    "У режимі витривалості немає обмежень на кількість слів, які ви можете запам'ятати, але чим більше слів ви спробуєте продивитись, тим важче буде їх запам'ятати, а всі слова, які ви не запам'ятаєте, будуть вважатися невивченими, тому ви можете припинити запам'ятовування в будь-який момент, щоб отримати найкращий результат.\n\nТакож зверніть увагу, що словниковий масив, який використовується в грі, є обмежений. Наразі містить лише # унікальних слів.",
  YourInputs: 'Ваші відповіді',
  StaminaLastWordWarning:
    "ВАУ! Це останнє слово в словниковому масиві, будь ласка, перейдіть до етапу перевірки та введіть всі запам'ятовані слова",
  WipeDataWarningTitle: 'Стерти всі дані',
  WipeDataWarning:
    'Ви впевнені, що хочете стерти всі ваші дані?\nЦя дія не може бути скасована',
  YourDataWasWiped: 'Ваші дані були стерті\nТепер ви можете почати з нуля',
  WipeDataFailed:
    'Не вдалося стерти дані\nБудь ласка, перезапустіть застосунок і спробуйте ще раз',
  ExportWarningTitle: 'Експорт даних',
  ExportWarning:
    'Ця дія створить файл з усіма вашими даними, який ви можете використовувати як резервну копію або для перенесення вашого прогресу на інший пристрій\nЕкспортуючи дані, ви не втрачаєте свій прогрес на цьому пристрої, при імпортуванні даних на поточний пристрій попередні дані будуть перезаписані',
  YourDataWasExported: 'Ваші дані були успішно експортовані',
  ExportFailed:
    'Не вдалося експортувати дані\nБудь ласка, перезапустіть застосунок і спробуйте ще раз',
  ImportWarningTitle: 'Імпорт даних',
  ImportWarning:
    'Ця дія перезапише всі ваші поточні дані даними з обраного файлу\nПісля завантаження файлу вам буде показано вікно для підтвердження вашого вибору з короткими даними файлу',
  YourDataWasImported: 'Ваші дані були успішно імпортовані',
  ImportFailed:
    'Не вдалося імпортувати дані\nБудь ласка, переконайтеся, що обраний файл є правильним і спробуйте ще раз',
  PlayedSince: 'Грає з',
  ExportedAt: 'Експортовано', // used in export preview after selecting file to import
  ImportDataPreview: 'Попередній перегляд даних',
  Confirm: 'Підтвердити',
  olive: 'Оливкова',
  darkBlue: 'Темно-синя',
  darkRed: 'Темно-червона',
  sky: 'Небесна',
  blackWhite: 'Чорно-біла',
  Learning: 'Навчання',
  GamesPlayedEasy: 'Ігор у легкому режимі',
  GamesPlayedHard: 'Ігор у складному режимі',
  GamesPlayedStamina: 'Ігор у режимі витривалості',
  WordsMemorizedEasy: "Слів запам'ятовано в легкому режимі",
  WordsMemorizedHard: "Слів запам'ятовано в складному режимі",
  WordsMemorizedStamina: "Слів запам'ятовано в режимі витривалості",
  AccuracyEasy: 'Точність в легкому режимі',
  AccuracyHard: 'Точність в складному режимі',
  AccuracyStamina: 'Точність в режимі витривалості',
  timePlayerEasy: 'Час гри в легкому режимі',
  timePlayerHard: 'Час гри в складному режимі',
  timePlayerStamina: 'Час гри в режимі витривалості',
  AverageTimePerGame: 'Середній час на гру',
  AverageTimePerWord: 'Середній час на слово',
  GamesStatistics: 'Статистика ігор',
  AverageAccuracy: 'Середня точність',
  Records: 'Рекорди',
  WordfullTitleDescription:
    "Тренуйте свою пам'ять та концентрацію, запам'ятовуючи слова у правильному порядку. Почніть тренувати свою пам'ять вже сьогодні!",
  NoInfo: 'Немає інформації',
  PlayYourFirstGame: 'Зіграти першу гру, щоб побачити статистику',
  PlayMoreGamesToUnlockYourPersonalBests:
    'Грай більше ігор, щоб бачити свої особисті рекорди',
  PrivacyPolicy: 'Політика конфіденційності',
  LearningScreenDescription:
    "Ви можете використовувати цей екран, щоб краще зрозуміти функціонал застосунку або навчитися методам запам'ятовування. Тут ви знайдете объяснення ігрових режимів та поради для покращення ваших навичок запам'ятовування.",
  AppVersion: 'Версія застосунку',
  ReportsAndFeedback: 'Звіти та відгуки',
  ScreenshotsDisabled: 'Скриншоти вимкнено',
  WordPacks: 'Словникові набори',
  simple_nouns: 'Прості іменники',
  complex_nouns: 'Складні іменники',
  abstract_nouns: 'Абстрактні іменники',
  Preview: 'Попередній перегляд',
  SmthWentWrongTryAgain: 'Щось пішло не так\nБудь ласка, спробуйте ще раз',
} satisfies Record<TextType, string>;

export default ukrainian;
